Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_pon_type.h
#ifndef _RTL8735B_PON_TYPE_H_
#define _RTL8735B_PON_TYPE_H_
#include "platform_conf.h"

/**************************************************************************//**
 * @defgroup PON_REG_PON_SYSON_CTRL
 * @brief                                            (@ 0X000)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PERIPLL_CTRL_SEL                   20
#define PON_BIT_PERIPLL_CTRL_SEL                     ((u32)0x00000001 << 20)                             /*!<R/W 0  1: PERIPLL control comes from PON register 0x018bit[10:5], 0x020[31:16], 0: PERIPLL control comes from hardware logic mux(as what we have done in TEST chip). */
#define PON_SHIFT_SYSPLL_CTRL_SEL                    19
#define PON_BIT_SYSPLL_CTRL_SEL                      ((u32)0x00000001 << 19)                             /*!<R/W 0  1: SYSPLL control comes from PON register 0x008bit[10:5], 0x010[31:16], 0: SYSPLL control comes from hardware logic mux(as what we have done in TEST chip). */
#define PON_SHIFT_PERIPLL_GATE                       18
#define PON_BIT_PERIPLL_GATE                         ((u32)0x00000001 << 18)                             /*!<R/W 0  0: PeriPLL gating */
#define PON_SHIFT_SYSPLL_GATE                        17
#define PON_BIT_SYSPLL_GATE                          ((u32)0x00000001 << 17)                             /*!<R/W 0  0: SYSPLL gating */
#define PON_SHIFT_PER1_RST_N                         16
#define PON_BIT_PER1_RST_N                           ((u32)0x00000001 << 16)                             /*!<R/W 1  0: Peri1 reset */
#define PON_SHIFT_PER0_RST_N                         15
#define PON_BIT_PER0_RST_N                           ((u32)0x00000001 << 15)                             /*!<R/W 1  0: Peri0 reset */
#define PON_SHIFT_BUS1_RST_N                         14
#define PON_BIT_BUS1_RST_N                           ((u32)0x00000001 << 14)                             /*!<R/W 1  0: Bus1 reset */
#define PON_SHIFT_BUS0_RST_N                         13
#define PON_BIT_BUS0_RST_N                           ((u32)0x00000001 << 13)                             /*!<R/W 1  0: Bus0 reset */
#define PON_SHIFT_PLATFORM_EN                        12
#define PON_BIT_PLATFORM_EN                          ((u32)0x00000001 << 12)                             /*!<R/W 0  1: enable platform */
#define PON_SHIFT_TM9_EN                             11
#define PON_BIT_TM9_EN                               ((u32)0x00000001 << 11)                             /*!<R/W 0  1: enable TM9 ; 0: reset */
#define PON_SHIFT_PLATFORM_CLK_EN                    10
#define PON_BIT_PLATFORM_CLK_EN                      ((u32)0x00000001 << 10)                             /*!<R/W 0  1: enable HS platform clock ; */
#define PON_SHIFT_TM9_CLK_EN                         9
#define PON_BIT_TM9_CLK_EN                           ((u32)0x00000001 << 9)                              /*!<R/W 0  1: enable TM9 clock ; 0: reset */
#define PON_SHIFT_ISO_PERIPLL                        8
#define PON_BIT_ISO_PERIPLL                          ((u32)0x00000001 << 8)                              /*!<R/W 1  1: isolation PeriPLL to PON domain; 0: disable isolation */
#define PON_SHIFT_ISO_SYSPLL                         7
#define PON_BIT_ISO_SYSPLL                           ((u32)0x00000001 << 7)                              /*!<R/W 1  1: isolation SYSPLL to PON domain; 0: disable isolation */
#define PON_SHIFT_VENDOR_REG_EN                      6
#define PON_BIT_VENDOR_REG_EN                        ((u32)0x00000001 << 6)                              /*!<R/W 0  1: enable VENDOR register */
#define PON_SHIFT_VENDOR_CLK_EN                      5
#define PON_BIT_VENDOR_CLK_EN                        ((u32)0x00000001 << 5)                              /*!<R/W 0  1: enable VENDOR register clock */
#define PON_SHIFT_SYSON_REG_EN                       4
#define PON_BIT_SYSON_REG_EN                         ((u32)0x00000001 << 4)                              /*!<R/W 0  1: enable SYSON register */
#define PON_SHIFT_SYSON_CLK_EN                       2
#define PON_BIT_SYSON_CLK_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable SYSON register clock */
#define PON_SHIFT_SYSON_LPC_EN                       1
#define PON_BIT_SYSON_LPC_EN                         ((u32)0x00000001 << 1)                              /*!<R/W 0  System on domain large power 0:Disable, 1: Enable */
#define PON_SHIFT_SYSON_SPC_EN                       0
#define PON_BIT_SYSON_SPC_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  System on domain small power 0:Disable, 1: Enable */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_SYSPLL_CTRL0
 * @brief                                            (@ 0X004)
 * @{
 *****************************************************************************/
#define PON_SHIFT_POW_ERC_SYS                        31
#define PON_BIT_POW_ERC_SYS                          ((u32)0x00000001 << 31)                             /*!<R/W 0  erc enable. */
#define PON_SHIFT_POW_DIV_IN_SYS                     30
#define PON_BIT_POW_DIV_IN_SYS                       ((u32)0x00000001 << 30)                             /*!<R/W 0  input divider enable (need pwl signal) 0 ->1 */
#define PON_SHIFT_POW_PLL_SYS                        29
#define PON_BIT_POW_PLL_SYS                          ((u32)0x00000001 << 29)                             /*!<R/W 0  (need pwl signal) 0 ->1 */
#define PON_SHIFT_REG_CP_BIA_SYS                     26
#define PON_MASK_REG_CP_BIA_SYS                      ((u32)0x00000007 << 26)                             /*!<R/W 000  charge pump current selection . Default=10uA CP current select : 000: Icp=10uA, 001: Icp=15uA, 010: Icp=20uA, 011: Icp=25uA; 100: Icp=30uA, 101: Icp=35uA, 110: Icp=40uA, 111: Icp=450uA;  */
#define PON_SHIFT_DOGENB_SYS                         25
#define PON_BIT_DOGENB_SYS                           ((u32)0x00000001 << 25)                             /*!<R/W 0  0: watch dog on, 1: watch dog off */
#define PON_SHIFT_REG_PS_SYS                         22
#define PON_MASK_REG_PS_SYS                          ((u32)0x00000007 << 22)                             /*!<R/W 000   */
#define PON_SHIFT_REG_PSEN_SYS                       21
#define PON_BIT_REG_PSEN_SYS                         ((u32)0x00000001 << 21)                             /*!<R/W 1  phase selector enable */
#define PON_SHIFT_REG_CP_SET_SYS                     19
#define PON_MASK_REG_CP_SET_SYS                      ((u32)0x00000003 << 19)                             /*!<R/W 11  Cp selection. Default=6p 00: Cp=3p, 01: Cp=4p, 10: Cp=5p, 11: Cp=6p */
#define PON_SHIFT_REG_RS_SET_SYS                     16
#define PON_MASK_REG_RS_SET_SYS                      ((u32)0x00000007 << 16)                             /*!<R/W 101  Rs selection. Default=7k 000: Rs=15k, 001: Rs=13k, 010: Rs=11k, 011: Rs=9k, 100: Rs=7k, 101: Rs=5k, 110: Rs=3k, 111: Rs=1k;  */
#define PON_SHIFT_REG_CS_SEL_SYS                     14
#define PON_MASK_REG_CS_SEL_SYS                      ((u32)0x00000003 << 14)                             /*!<R/W 10  Cs selection. Default=60p 00: Cs=30p, 01: Cs=40p, 10: Cs=50p, 11: Cs=60p */
#define PON_SHIFT_REG_FREF_EDGE_SYS                  13
#define PON_BIT_REG_FREF_EDGE_SYS                    ((u32)0x00000001 << 13)                             /*!<R/W 1  0:fref, 1:frefb */
#define PON_SHIFT_REG_CK_EN_SYS                      12
#define PON_BIT_REG_CK_EN_SYS                        ((u32)0x00000001 << 12)                             /*!<R/W 1  output clk enable */
#define PON_SHIFT_REG_CK_EN_D2_SYS                   11
#define PON_BIT_REG_CK_EN_D2_SYS                     ((u32)0x00000001 << 11)                             /*!<R/W 0  output clk div 2 enable */
#define PON_SHIFT_REG_CK_OUT_SEL_SYS0                8
#define PON_MASK_REG_CK_OUT_SEL_SYS0                 ((u32)0x00000007 << 8)                              /*!<R/W 000  reserved */
#define PON_SHIFT_REG_XTAL_MANUAL_MODE_SYS           7
#define PON_BIT_REG_XTAL_MANUAL_MODE_SYS             ((u32)0x00000001 << 7)                              /*!<R/W 1  reg_xtal_maunal_mode. Default=0 0: reg_xtal_sel<3:0> is controlled by REG, xtal_div_sel is controlled by mapping table. 1: reg_xtal_sel<3:0>=4'b1111, xtal_div_sel is controlled by reg_xtal_div_sel_maunal<1:0> */
#define PON_SHIFT_REG_XTAL_DIV_SEL_MANUAL_SYS        5
#define PON_MASK_REG_XTAL_DIV_SEL_MANUAL_SYS         ((u32)0x00000003 << 5)                              /*!<R/W 00  input divider selection in xtal maunal mode. Default=00 00=/1, 01=/2, 1X=/4 */
#define PON_SHIFT_REG_VC_THL_SYS                     3
#define PON_MASK_REG_VC_THL_SYS                      ((u32)0x00000003 << 3)                              /*!<R/W 00  VC voltage, Default=00 00: VC=1/4Vdd, 01: VC=1/2Vdd, 10=3/4Vdd, 11: VC=Vdd */
#define PON_SHIFT_C3_SET_SYS                         1
#define PON_MASK_C3_SET_SYS                          ((u32)0x00000003 << 1)                              /*!<R/W 0   */
#define PON_SHIFT_R3_SET_SYS                         0
#define PON_BIT_R3_SET_SYS                           ((u32)0x00000001 << 0)                              /*!<R/W 1  Rs selection. Default=1k 0: 0 Ohm, 1: 1k Ohm */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_SYSPLL_CTRL1
 * @brief                                            (@ 0X008)
 * @{
 *****************************************************************************/
#define PON_SHIFT_REG_XTAL_SEL_SYS                   28
#define PON_MASK_REG_XTAL_SEL_SYS                    ((u32)0x0000000F << 28)                             /*!<R 0000  xtal selection, Default=40MHz 0000= 40MHz, 0001= 25MHz, 0010= 13MHz, 0011= 19.2MHz 0100= 20MHz, 0101= 26MHz, 0110= 38.4MHz, 0111= 17.664MHz 1000= 16MHz, 1001= 14.138MHz, 1010= 12MHz, 1011= 52MHz 1100= 48MHz, 1101= 27MHz, 1110= 24MHz, 1111= none  */
#define PON_SHIFT_REG_FREQ_SEL_SYS                   24
#define PON_MASK_REG_FREQ_SEL_SYS                    ((u32)0x0000000F << 24)                             /*!<R/W 0000  output clk selection, Default=500MHz 0000= 400MHz, 0001= 300MHz, 0010= X, 0011= X, 0100= 216MHz, 0101=196.608MHz, 0110=192MHz, 0111= 180.632MHz, 1000= 148.5MHz, 1001= X, 1010= X, 1011= X, 1100= X, 1101= X, 1110= X, 1111= 500MHz  */
#define PON_SHIFT_TBASE_FREQ_SYS                     20
#define PON_MASK_TBASE_FREQ_SYS                      ((u32)0x0000000F << 20)                             /*!<R/W 0000   */
#define PON_SHIFT_STEP_FREQ_SYS                      16
#define PON_MASK_STEP_FREQ_SYS                       ((u32)0x0000000F << 16)                             /*!<R/W 0000  step size selection for switching freq. */
#define PON_SHIFT_TRIG_FREQ_SYS                      15
#define PON_BIT_TRIG_FREQ_SYS                        ((u32)0x00000001 << 15)                             /*!<R/W 0  freq. step up or step down enable */
#define PON_SHIFT_BB_DBG_SEL_AFE_SDM_SYS             11
#define PON_MASK_BB_DBG_SEL_AFE_SDM_SYS              ((u32)0x0000000F << 11)                             /*!<R/W 0000   */
#define PON_SHIFT_DIVN_SDM_SYS                       5
#define PON_MASK_DIVN_SDM_SYS                        ((u32)0x0000003F << 5)                              /*!<R/W 1010  500M 40M: 001010 26M: 010001 300M 40M: 000101 26M: 001001 */
#define PON_SHIFT_REG_CK_OUT_SEL_SYS1                1
#define PON_MASK_REG_CK_OUT_SEL_SYS1                 ((u32)0x0000000F << 1)                              /*!<R/W 0000  output divider selection. Default=0000 0000=/1, 1000=/2 or /4, 1100=/8, 1110=/16, 1111=/32 */
#define PON_SHIFT_ICP_HALF_SYS                       0
#define PON_BIT_ICP_HALF_SYS                         ((u32)0x00000001 << 0)                              /*!<R/W 1  charge pump current half or not 0: no half 1: half */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_SYSPLL_CTRL2
 * @brief                                            (@ 0X00C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_STEP_SYS                           19
#define PON_MASK_STEP_SYS                            ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  ssc step size selection. */
#define PON_SHIFT_TBASE_SYS                          7
#define PON_MASK_TBASE_SYS                           ((u32)0x00000FFF << 7)                              /*!<R/W 000000000000  ssc freq selection */
#define PON_SHIFT_EN_SSC_SYS                         6
#define PON_BIT_EN_SSC_SYS                           ((u32)0x00000001 << 6)                              /*!<R/W 0  ssc enable. Default=0 */
#define PON_SHIFT_PLL_SYS2                           0
#define PON_MASK_PLL_SYS2                            ((u32)0x0000003F << 0)                              /*!<R/W 000000   */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_SYSPLL_CTRL3
 * @brief                                            (@ 0X010)
 * @{
 *****************************************************************************/
#define PON_SHIFT_F0F_SDM_SYS                        19
#define PON_MASK_F0F_SDM_SYS                         ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  500M 40M: 0_0000_0000_0000 26M: 1_1011_0001_0100 300M 40M: 0_0000_0000_0000 26M: 0_1001_1101_1001 */
#define PON_SHIFT_F0N_SDM_SYS                        16
#define PON_MASK_F0N_SDM_SYS                         ((u32)0x00000007 << 16)                             /*!<R/W 100  500M 40M: 100 26M: 011 300M 40M: 100 26M: 100 */
#define PON_SHIFT_ORDER_SDM_SYS                      15
#define PON_BIT_ORDER_SDM_SYS                        ((u32)0x00000001 << 15)                             /*!<R/W 0  SDM order */
#define PON_SHIFT_PLL_SYS3                           0
#define PON_MASK_PLL_SYS3                            ((u32)0x00007FFF << 0)                              /*!<R/W 000000000000000   */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_PERIPLL_CTRL0
 * @brief                                            (@ 0X014)
 * @{
 *****************************************************************************/
#define PON_SHIFT_POW_ERC_PERI                       31
#define PON_BIT_POW_ERC_PERI                         ((u32)0x00000001 << 31)                             /*!<R/W 0  erc enable. */
#define PON_SHIFT_POW_DIV_IN_PERI                    30
#define PON_BIT_POW_DIV_IN_PERI                      ((u32)0x00000001 << 30)                             /*!<R/W 0  input divider enable (need pwl signal) 0 ->1 */
#define PON_SHIFT_POW_PLL_PERI                       29
#define PON_BIT_POW_PLL_PERI                         ((u32)0x00000001 << 29)                             /*!<R/W 0  (need pwl signal) 0 -> 1 */
#define PON_SHIFT_REG_CP_BIA_PERI                    26
#define PON_MASK_REG_CP_BIA_PERI                     ((u32)0x00000007 << 26)                             /*!<R/W 000  charge pump current selection . Default=10uA CP current select : 000: Icp=10uA, 001: Icp=15uA, 010: Icp=20uA, 011: Icp=25uA; 100: Icp=30uA, 101: Icp=35uA, 110: Icp=40uA, 111: Icp=450uA;  */
#define PON_SHIFT_DOGENB_PERI                        25
#define PON_BIT_DOGENB_PERI                          ((u32)0x00000001 << 25)                             /*!<R/W 0  0: watch dog on, 1: watch dog off */
#define PON_SHIFT_REG_PS_PERI                        22
#define PON_MASK_REG_PS_PERI                         ((u32)0x00000007 << 22)                             /*!<R/W 000   */
#define PON_SHIFT_REG_PSEN_PERI                      21
#define PON_BIT_REG_PSEN_PERI                        ((u32)0x00000001 << 21)                             /*!<R/W 1  phase selector enable */
#define PON_SHIFT_REG_CP_SET_PERI                    19
#define PON_MASK_REG_CP_SET_PERI                     ((u32)0x00000003 << 19)                             /*!<R/W 11  Cp selection. Default=6p 00: Cp=3p, 01: Cp=4p, 10: Cp=5p, 11: Cp=6p */
#define PON_SHIFT_REG_RS_SET_PERI                    16
#define PON_MASK_REG_RS_SET_PERI                     ((u32)0x00000007 << 16)                             /*!<R/W 101  Rs selection. Default=7k 000: Rs=15k, 001: Rs=13k, 010: Rs=11k, 011: Rs=9k, 100: Rs=7k, 101: Rs=5k, 110: Rs=3k, 111: Rs=1k;  */
#define PON_SHIFT_REG_CS_SEL_PERI                    14
#define PON_MASK_REG_CS_SEL_PERI                     ((u32)0x00000003 << 14)                             /*!<R/W 10  Cs selection. Default=60p 00: Cs=30p, 01: Cs=40p, 10: Cs=50p, 11: Cs=60p */
#define PON_SHIFT_REG_FREF_EDGE_PERI                 13
#define PON_BIT_REG_FREF_EDGE_PERI                   ((u32)0x00000001 << 13)                             /*!<R/W 1  0:fref, 1:frefb */
#define PON_SHIFT_REG_CK_EN_PERI                     12
#define PON_BIT_REG_CK_EN_PERI                       ((u32)0x00000001 << 12)                             /*!<R/W 1  output clk enable */
#define PON_SHIFT_REG_CK_EN_D2_PERI                  11
#define PON_BIT_REG_CK_EN_D2_PERI                    ((u32)0x00000001 << 11)                             /*!<R/W 0  output clk div 4 enable */
#define PON_SHIFT_REG_CK_OUT_SEL_PERI0               8
#define PON_MASK_REG_CK_OUT_SEL_PERI0                ((u32)0x00000007 << 8)                              /*!<R/W 000  reserved */
#define PON_SHIFT_REG_XTAL_MANUAL_MODE_PERI          7
#define PON_BIT_REG_XTAL_MANUAL_MODE_PERI            ((u32)0x00000001 << 7)                              /*!<R/W 1  reg_xtal_maunal_mode. Default=0 0: reg_xtal_sel<3:0> is controlled by REG, xtal_div_sel is controlled by mapping table. 1: reg_xtal_sel<3:0>=4'b1111, xtal_div_sel is controlled by reg_xtal_div_sel_maunal<1:0> */
#define PON_SHIFT_REG_XTAL_DIV_SEL_MANUAL_PERI       5
#define PON_MASK_REG_XTAL_DIV_SEL_MANUAL_PERI        ((u32)0x00000003 << 5)                              /*!<R/W 00  input divider selection in xtal maunal mode. Default=00 00=/1, 01=/2, 1X=/4 */
#define PON_SHIFT_REG_VC_THL_PERI                    3
#define PON_MASK_REG_VC_THL_PERI                     ((u32)0x00000003 << 3)                              /*!<R/W 00  VC voltage, Default=00 00: VC=1/4Vdd, 01: VC=1/2Vdd, 10=3/4Vdd, 11: VC=Vdd */
#define PON_SHIFT_C3_SET_PERI                        1
#define PON_MASK_C3_SET_PERI                         ((u32)0x00000003 << 1)                              /*!<R/W 0   */
#define PON_SHIFT_R3_SET_PERI                        0
#define PON_BIT_R3_SET_PERI                          ((u32)0x00000001 << 0)                              /*!<R/W 1  Rs selection. Default=1k 0: 0 Ohm, 1: 1k Ohm */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_PERIPLL_CTRL1
 * @brief                                            (@ 0X018)
 * @{
 *****************************************************************************/
#define PON_SHIFT_REG_XTAL_SEL_PERI                  28
#define PON_MASK_REG_XTAL_SEL_PERI                   ((u32)0x0000000F << 28)                             /*!<R 0000  xtal selection, Default=40MHz 0000= 40MHz, 0001= 25MHz, 0010= 13MHz, 0011= 19.2MHz 0100= 20MHz, 0101= 26MHz, 0110= 38.4MHz, 0111= 17.664MHz 1000= 16MHz, 1001= 14.138MHz, 1010= 12MHz, 1011= 52MHz 1100= 48MHz, 1101= 27MHz, 1110= 24MHz, 1111= none  */
#define PON_SHIFT_REG_FREQ_SEL_PERI                  24
#define PON_MASK_REG_FREQ_SEL_PERI                   ((u32)0x0000000F << 24)                             /*!<R/W 0000  output clk selection, Default=400MHz 0000= 400MHz, 0001= X, 0010= X, 0011= X, 0100= 216MHz, 0101=196.608MHz, 0110=192MHz, 0111= 180.632MHz, 1000= 148.5MHz,1001= X, 1010= X, 1011= X, 1100= X, 1101= X, 1110= X, 1111= 500MHz  */
#define PON_SHIFT_TBASE_FREQ_PERI                    20
#define PON_MASK_TBASE_FREQ_PERI                     ((u32)0x0000000F << 20)                             /*!<R/W 0000   */
#define PON_SHIFT_STEP_FREQ_PERI                     16
#define PON_MASK_STEP_FREQ_PERI                      ((u32)0x0000000F << 16)                             /*!<R/W 0000  step size selection for switching freq. 0000: 2^5 0001: 2^6 0010: 2^7 0011: 2^8 0100: 2^9 0101: 2^10 0110: 2^11 0111: 2^12 */
#define PON_SHIFT_TRIG_FREQ_PERI                     15
#define PON_BIT_TRIG_FREQ_PERI                       ((u32)0x00000001 << 15)                             /*!<R/W 0  freq. step up or step down enable */
#define PON_SHIFT_BB_DBG_SEL_AFE_SDM_PERI            11
#define PON_MASK_BB_DBG_SEL_AFE_SDM_PERI             ((u32)0x0000000F << 11)                             /*!<R/W 0000   */
#define PON_SHIFT_DIVN_SDM_PERI                      5
#define PON_MASK_DIVN_SDM_PERI                       ((u32)0x0000003F << 5)                              /*!<R/W 1000  400M 40M: 001000 26M: 001101  */
#define PON_SHIFT_REG_CK_OUT_SEL_PERI1               1
#define PON_MASK_REG_CK_OUT_SEL_PERI1                ((u32)0x0000000F << 1)                              /*!<R/W 0000  output divider selection. Default=0000 0000=/1, 1000=/2 or /4, 1100=/8, 1110=/16, 1111=/32 */
#define PON_SHIFT_ICP_HALF_PERI                      0
#define PON_BIT_ICP_HALF_PERI                        ((u32)0x00000001 << 0)                              /*!<R/W 1  charge pump current half or not 0: no half 1: half */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_PERIPLL_CTRL2
 * @brief                                            (@ 0X01C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_STEP_PERI                          19
#define PON_MASK_STEP_PERI                           ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  ssc step size selection. */
#define PON_SHIFT_TBASE_PERI                         7
#define PON_MASK_TBASE_PERI                          ((u32)0x00000FFF << 7)                              /*!<R/W 000000000000  ssc freq selection */
#define PON_SHIFT_EN_SSC_PERI                        6
#define PON_BIT_EN_SSC_PERI                          ((u32)0x00000001 << 6)                              /*!<R/W 0  ssc enable. Default=0 */
#define PON_SHIFT_PLL_PERI2                          0
#define PON_MASK_PLL_PERI2                           ((u32)0x0000003F << 0)                              /*!<R/W 000000   */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_PERIPLL_CTRL3
 * @brief                                            (@ 0X020)
 * @{
 *****************************************************************************/
#define PON_SHIFT_F0F_SDM_PERI                       19
#define PON_MASK_F0F_SDM_PERI                        ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  400M 40M: 0_0000_0000_0000 26M: 0_0010_0111_0110 */
#define PON_SHIFT_F0N_SDM_PERI                       16
#define PON_MASK_F0N_SDM_PERI                        ((u32)0x00000007 << 16)                             /*!<R/W 000  400M 40M: 000 26M: 011  */
#define PON_SHIFT_ORDER_SDM_PERI                     15
#define PON_BIT_ORDER_SDM_PERI                       ((u32)0x00000001 << 15)                             /*!<R/W 0  SDM order */
#define PON_SHIFT_PLL_PERI3                          0
#define PON_MASK_PLL_PERI3                           ((u32)0x00007FFF << 0)                              /*!<R/W 000000000000000   */
/** @} */

