Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_pon_type.h
/**************************************************************************//**
 * @defgroup PON_REG_PON_FUNC_EN_CTRL
 * @brief                                            (@ 0X024)
 * @{
 *****************************************************************************/
#define PON_SHIFT_GPIO_EN                            3
#define PON_BIT_GPIO_EN                              ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Enable PON GPIO block */
#define PON_SHIFT_PWM_EN                             2
#define PON_BIT_PWM_EN                               ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable PWM block */
#define PON_SHIFT_TIMER0_EN                          1
#define PON_BIT_TIMER0_EN                            ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable TIMER0 block */
#define PON_SHIFT_UART0_EN                           0
#define PON_BIT_UART0_EN                             ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable UART0 block */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_PLL_DBG
 * @brief                                            (@ 0X028)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PLL_TEST                           13
#define PON_MASK_PLL_TEST                            ((u32)0x00000007 << 13)                             /*!<R/W 000   */
#define PON_SHIFT_REG0X_TEST                         12
#define PON_BIT_REG0X_TEST                           ((u32)0x00000001 << 12)                             /*!<R/W 0  0 = ckmon , 1 = ckmon/4 */
#define PON_SHIFT_POW_DIV4                           11
#define PON_BIT_POW_DIV4                             ((u32)0x00000001 << 11)                             /*!<R/W 1  pow of divider4 */
#define PON_SHIFT_ISO                                10
#define PON_BIT_ISO                                  ((u32)0x00000001 << 10)                             /*!<R/W 0  1 for ISO ck_fref/ck_frefb */
#define PON_SHIFT_REF_CLK_SEL                        9
#define PON_BIT_REF_CLK_SEL                          ((u32)0x00000001 << 9)                              /*!<R/W 0  xtal clk from 0 special route 1 APR */
#define PON_SHIFT_CK_MON_EN                          8
#define PON_BIT_CK_MON_EN                            ((u32)0x00000001 << 8)                              /*!<R/W 0  ckmon enable */
#define PON_SHIFT_CK_SEL                             4
#define PON_MASK_CK_SEL                              ((u32)0x0000000F << 4)                              /*!<R/W 0000  ckmon clk sel 1111:CK_400M_ISP 1110:READY_400M 1101:CK_ISPS 1100:READY_ISPS 1011:CK_300M_SYS 1010:READY_300M 1001:CK_240M_ENC 1000:READY_240M_ENC 0111:CK_80M_PERI 0110:READY_80M_PERI 0101:CK_98P304M_I2S 0100:CK_24P576M_I2S 0011:READY_I2S 0010:CK_45P158M_PCM 0001:READY_45P158M_PCM 0000:TL */
#define PON_SHIFT_APGIO_DRIVE                        2
#define PON_MASK_APGIO_DRIVE                         ((u32)0x00000003 << 2)                              /*!<R/W 11  AGPIO driving sel */
#define PON_SHIFT_GPO                                1
#define PON_BIT_GPO                                  ((u32)0x00000001 << 1)                              /*!<R/W 0  AGPIO CLK SEL 0=external 1=pll */
#define PON_SHIFT_GPE                                0
#define PON_BIT_GPE                                  ((u32)0x00000001 << 0)                              /*!<R/W 0  AGPIO enable */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_FUNC_CLK_CTRL
 * @brief                                            (@ 0X02C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DUMMY_GPIO                         27
#define PON_MASK_DUMMY_GPIO                          ((u32)0x0000001F << 27)                             /*!<R/W 0   */
#define PON_SHIFT_INTR_CLK_GPIO_SEL                  26
#define PON_BIT_INTR_CLK_GPIO_SEL                    ((u32)0x00000001 << 26)                             /*!<R/W 0  Interrupt Clock Select 0:APB CLK 1:32kHz */
#define PON_SHIFT_SCLK_GPIO_EN                       25
#define PON_BIT_SCLK_GPIO_EN                         ((u32)0x00000001 << 25)                             /*!<R/W 0  1: Enable GPIO Sclock */
#define PON_SHIFT_PCLK_GPIO_EN                       24
#define PON_BIT_PCLK_GPIO_EN                         ((u32)0x00000001 << 24)                             /*!<R/W 0  1: Enable GPIO Pclock */
#define PON_SHIFT_RSVD1                              23
#define PON_BIT_RSVD1                                ((u32)0x00000001 << 23)                             /*!<R/W 0   */
#define PON_SHIFT_DUMMY_PWM                          21
#define PON_MASK_DUMMY_PWM                           ((u32)0x00000003 << 21)                             /*!<R/W 0   */
#define PON_SHIFT_INTR_CLK_PWM_SEL                   20
#define PON_BIT_INTR_CLK_PWM_SEL                     ((u32)0x00000001 << 20)                             /*!<R/W 0  Interrupt Clock Select 0:APB CLK 1:TIMER0 CLK */
#define PON_SHIFT_SCLK_PWM_SEL                       18
#define PON_MASK_SCLK_PWM_SEL                        ((u32)0x00000003 << 18)                             /*!<R/W 00  PWM Sclock Select 00:32KHz(S1) 01:IRC_4MHz(ANA_CLK) 10:PERI_PLL_40MHz 11:RSVD */
#define PON_SHIFT_SCLK_PWM_EN                        17
#define PON_BIT_SCLK_PWM_EN                          ((u32)0x00000001 << 17)                             /*!<R/W 0  1: Enable PWM Sclock */
#define PON_SHIFT_PCLK_PWM_EN                        16
#define PON_BIT_PCLK_PWM_EN                          ((u32)0x00000001 << 16)                             /*!<R/W 0  1: Enable PWM Pclock */
#define PON_SHIFT_RSVD2                              15
#define PON_BIT_RSVD2                                ((u32)0x00000001 << 15)                             /*!<R/W 0   */
#define PON_SHIFT_DUMMY_TIMER0                       13
#define PON_MASK_DUMMY_TIMER0                        ((u32)0x00000003 << 13)                             /*!<R/W 0   */
#define PON_SHIFT_INTR_CLK_TIMER0_SEL                12
#define PON_BIT_INTR_CLK_TIMER0_SEL                  ((u32)0x00000001 << 12)                             /*!<R/W 0  Interrupt Clock Select 0:APB CLK 1:TIMER0 CLK */
#define PON_SHIFT_SCLK_TIMER0_SEL                    10
#define PON_MASK_SCLK_TIMER0_SEL                     ((u32)0x00000003 << 10)                             /*!<R/W 00  TIMER0 Sclock Select 00:32KHz(S1) 01:IRC_4MHz(ANA_CLK) 10:PERI_PLL_40MHz 11:RSVD */
#define PON_SHIFT_SCLK_TIMER0_EN                     9
#define PON_BIT_SCLK_TIMER0_EN                       ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Enable TIMER0 Sclock */
#define PON_SHIFT_PCLK_TIMER0_EN                     8
#define PON_BIT_PCLK_TIMER0_EN                       ((u32)0x00000001 << 8)                              /*!<R/W 0  1: Enable TIMER0 Pclock */
#define PON_SHIFT_RSVD3                              7
#define PON_BIT_RSVD3                                ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define PON_SHIFT_DUMMY_UART0                        5
#define PON_MASK_DUMMY_UART0                         ((u32)0x00000003 << 5)                              /*!<R/W 0   */
#define PON_SHIFT_SCLK_UART0_SEL                     3
#define PON_MASK_SCLK_UART0_SEL                      ((u32)0x00000003 << 3)                              /*!<R/W 00  UART0 Sclock Select 00:IRC_4MHz(ANA_CLK) 01:PERI_PLL_40MHz 10:XTAL Clock 40MHz 11:RSVD */
#define PON_SHIFT_SCLK_UART0_EN                      2
#define PON_BIT_SCLK_UART0_EN                        ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable UART0 Sclock */
#define PON_SHIFT_PCLK_UART0_EN                      1
#define PON_BIT_PCLK_UART0_EN                        ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable UART0 Pclock */
#define PON_SHIFT_UART0_BD_EN                        0
#define PON_BIT_UART0_BD_EN                          ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable UART0 bus domain */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_BT_CTRL
 * @brief                                            (@ 0X030)
 * @{
 *****************************************************************************/
#define PON_SHIFT_BT_SEL                             4
#define PON_BIT_BT_SEL                               ((u32)0x00000001 << 4)                              /*!<R/W 0  0: Internal, 1:External */
#define PON_SHIFT_BT_MP_I2C_EN                       3
#define PON_BIT_BT_MP_I2C_EN                         ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Enable */
#define PON_SHIFT_40MCLK_BT_EN                       2
#define PON_BIT_40MCLK_BT_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable BT 40MHz clock */
#define PON_SHIFT_32KCLK_BT_EN                       1
#define PON_BIT_32KCLK_BT_EN                         ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable BT 32kHz clock */
#define PON_SHIFT_BT_EN                              0
#define PON_BIT_BT_EN                                ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enale BT block; 0: Reset BT block */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_UART_INTR_STS
 * @brief                                            (@ 0X034)
 * @{
 *****************************************************************************/
#define PON_SHIFT_UART0_ISR                          0
#define PON_BIT_UART0_ISR                            ((u32)0x00000001 << 0)                              /*!<R 0  UART0 Interrupt Status */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_WDT_RST_CTRL
 * @brief                                            (@ 0X038)
 * @{
 *****************************************************************************/
#define PON_SHIFT_RSVD4                              5
#define PON_MASK_RSVD4                               ((u32)0x07FFFFFF << 5)                              /*!<R/W 0   */
#define PON_SHIFT_SYSON_WDT_RST_MSK                  4
#define PON_BIT_SYSON_WDT_RST_MSK                    ((u32)0x00000001 << 4)                              /*!<R/W 0  1: Enable WDOG_RST to reset SYSON block */
#define PON_SHIFT_CPU_WDT_RST_MSK                    3
#define PON_BIT_CPU_WDT_RST_MSK                      ((u32)0x00000001 << 3)                              /*!<R/W 0  0: Enable WDOG_RST to trigger CPU wram reset 1: Enable WDOG_RST to trigger CPU cold reset */
#define PON_SHIFT_WLON_WDT_RST_MSK                   2
#define PON_BIT_WLON_WDT_RST_MSK                     ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable WDOG_RST to reset WLON block */
#define PON_SHIFT_PON_WDT_RST_MSK                    1
#define PON_BIT_PON_WDT_RST_MSK                      ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable WDOG_RST to reset PON block */
#define PON_SHIFT_AON_WDT_RST_MSK                    0
#define PON_BIT_AON_WDT_RST_MSK                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable WDOG_RST to reset AON block */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_BUS_CTRL
 * @brief                                            (@ 0X03C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_SRAM1_RET                          3
#define PON_BIT_SRAM1_RET                            ((u32)0x00000001 << 3)                              /*!<R/W 0  1: SRAM1 Retention Mode */
#define PON_SHIFT_SRAM1_SD                           2
#define PON_BIT_SRAM1_SD                             ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Shutdown SRAM1 */
#define PON_SHIFT_SRAM0_RET                          1
#define PON_BIT_SRAM0_RET                            ((u32)0x00000001 << 1)                              /*!<R/W 0  1: SRAM0 Retention Mode */
#define PON_SHIFT_SRAM0_SD                           0
#define PON_BIT_SRAM0_SD                             ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Shutdown SRAM0 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_PLL_DIVIDER_CTRL
 * @brief                                            (@ 0X040)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DIVIDER_PERI                       15
#define PON_MASK_DIVIDER_PERI                        ((u32)0x0000001F << 15)                             /*!<R/W 0  Div:N+1,N=0~31 */
#define PON_SHIFT_DIVIDER_C6                         10
#define PON_MASK_DIVIDER_C6                          ((u32)0x0000001F << 10)                             /*!<R/W 0x5  Div:N+1,N=0~31, >= 5 to C6 divider register and invalid number(<5) write to the register will be ignored. */
#define PON_SHIFT_DIVIDER_C5                         5
#define PON_MASK_DIVIDER_C5                          ((u32)0x0000001F << 5)                              /*!<R/W 0x2  Div:N+1,N=0~31, >= 2 to C5 divider registe and invalid number (<2)write to the register will be ignored. */
#define PON_SHIFT_DIVIDER_SYS                        0
#define PON_MASK_DIVIDER_SYS                         ((u32)0x0000001F << 0)                              /*!<R/W 0  Div:N+1,N=0~31 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_SUPER_SEC_EF_CTRL
 * @brief                                            (@ 0X044)
 * @{
 *****************************************************************************/
#define PON_SHIFT_SEC_SUPER_SEC_OTP_LOCK             0
#define PON_BIT_SEC_SUPER_SEC_OTP_LOCK               ((u32)0x00000001 << 0)                              /*!<R/W 1 Once 0  Lock OTP Super Secure Zone 1: Lock OTP Super Secure zone; 0: Unlock OTP Super Secure zone "When this bit is written to '1', this bit cannot be written to "0", unless the platform reset. */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_BOOT_STATE
 * @brief                                            (@ 0X048)
 * @{
 *****************************************************************************/
#define PON_SHIFT_BOOT_STATE                         0
#define PON_MASK_BOOT_STATE                          ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   For SW use */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_BOOT_STATE1
 * @brief                                            (@ 0X04C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_UUID3                              24
#define PON_MASK_UUID3                               ((u32)0x000000FF << 24)                             /*!<R/W Once 0xFF   For SW use */
#define PON_SHIFT_UUID2                              16
#define PON_MASK_UUID2                               ((u32)0x000000FF << 16)                             /*!<R/W Once 0xFF   For SW use */
#define PON_SHIFT_UUID1                              8
#define PON_MASK_UUID1                               ((u32)0x000000FF << 8)                              /*!<R/W Once 0xFF   For SW use */
#define PON_SHIFT_UUID0                              0
#define PON_MASK_UUID0                               ((u32)0x000000FF << 0)                              /*!<R/W Once 0xFF   For SW use */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_0_1_CTRL
 * @brief                                            (@ 0X050)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO1_SLEW_RATE                28
#define PON_BIT_PON_GPIO1_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO1_DRIVING                  26
#define PON_MASK_PON_GPIO1_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO1_SMT_EN                   25
#define PON_BIT_PON_GPIO1_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO1 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO1_PULL_CTRL                22
#define PON_MASK_PON_GPIO1_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO1_PINMUX_SEL               16
#define PON_MASK_PON_GPIO1_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: ADC1 0001: I2C1_SCL 0010: 0011: RFE_CTRL_0 0100: 0101: 0110:UART1_CTS 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO0_SLEW_RATE                12
#define PON_BIT_PON_GPIO0_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO0_DRIVING                  10
#define PON_MASK_PON_GPIO0_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO0_SMT_EN                   9
#define PON_BIT_PON_GPIO0_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO0 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO0_PULL_CTRL                6
#define PON_MASK_PON_GPIO0_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO0_PINMUX_SEL               0
#define PON_MASK_PON_GPIO0_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: ADC0 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_2_3_CTRL
 * @brief                                            (@ 0X054)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO3_SLEW_RATE                28
#define PON_BIT_PON_GPIO3_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO3_DRIVING                  26
#define PON_MASK_PON_GPIO3_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO3_SMT_EN                   25
#define PON_BIT_PON_GPIO3_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO3 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO3_PULL_CTRL                22
#define PON_MASK_PON_GPIO3_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO3_PINMUX_SEL               16
#define PON_MASK_PON_GPIO3_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: ADC3 0001: 0010: 0011: RFE_CTRL_2 0100: SDIO_D2 0101: 0110:UART1_IN 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO2_SLEW_RATE                12
#define PON_BIT_PON_GPIO2_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO2_DRIVING                  10
#define PON_MASK_PON_GPIO2_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO2_SMT_EN                   9
#define PON_BIT_PON_GPIO2_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO2 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO2_PULL_CTRL                6
#define PON_MASK_PON_GPIO2_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO2_PINMUX_SEL               0
#define PON_MASK_PON_GPIO2_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: ADC2 0001: I2C1_SDA 0010: 0011: RFE_CTRL_1 0100: 0101: 0110:UART1_RTS 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_4_5_CTRL
 * @brief                                            (@ 0X058)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO5_SLEW_RATE                28
#define PON_BIT_PON_GPIO5_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO5_DRIVING                  26
#define PON_MASK_PON_GPIO5_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO5_SMT_EN                   25
#define PON_BIT_PON_GPIO5_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO5 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO5_PULL_CTRL                22
#define PON_MASK_PON_GPIO5_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO5_PINMUX_SEL               16
#define PON_MASK_PON_GPIO5_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: 0010: 0011: 0100:SDIO_D0 0101:SPI_1_MISO 0110:TPIU_DATA_0 0111: 1000: SPI_3_MISO 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO4_SLEW_RATE                12
#define PON_BIT_PON_GPIO4_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO4_DRIVING                  10
#define PON_MASK_PON_GPIO4_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO4_SMT_EN                   9
#define PON_BIT_PON_GPIO4_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO4 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO4_PULL_CTRL                6
#define PON_MASK_PON_GPIO4_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO4_PINMUX_SEL               0
#define PON_MASK_PON_GPIO4_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: 0011: 0100: SDIO_D1 0101: 0110:UART1_OUT 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

