Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_pon_type.h
/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_6_7_CTRL
 * @brief                                            (@ 0X05C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO7_SLEW_RATE                28
#define PON_BIT_PON_GPIO7_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO7_DRIVING                  26
#define PON_MASK_PON_GPIO7_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO7_SMT_EN                   25
#define PON_BIT_PON_GPIO7_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO7 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO7_PULL_CTRL                22
#define PON_MASK_PON_GPIO7_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO7_PINMUX_SEL               16
#define PON_MASK_PON_GPIO7_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: 0010: PWM1 0011: JTAG_TDI 0100:SDIO_CMD 0101:SPI_1_MOSI 0110:TPIU_DATA_2 0111: BT_JTAG_TDI 1000: SPI_3_MOSI 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO6_SLEW_RATE                12
#define PON_BIT_PON_GPIO6_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO6_DRIVING                  10
#define PON_MASK_PON_GPIO6_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO6_SMT_EN                   9
#define PON_BIT_PON_GPIO6_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO6 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO6_PULL_CTRL                6
#define PON_MASK_PON_GPIO6_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO6_PINMUX_SEL               0
#define PON_MASK_PON_GPIO6_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: PWM0 0011: JTAG_TDO 0100:SDIO_CLK 0101:SPI_1_SCL 0110:TPIU_DATA_1 0111: BT_JTAG_TDO 1000: SPI_3_SCL 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_8_9_CTRL
 * @brief                                            (@ 0X060)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO9_SLEW_RATE                28
#define PON_BIT_PON_GPIO9_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO9_DRIVING                  26
#define PON_MASK_PON_GPIO9_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO9_SMT_EN                   25
#define PON_BIT_PON_GPIO9_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO9 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO9_PULL_CTRL                22
#define PON_MASK_PON_GPIO9_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO9_PINMUX_SEL               16
#define PON_MASK_PON_GPIO9_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: SGPIO 0010: PWM3 0011: JTAG_CLK/SWD_CK 0100: 0101:SPI_1_CS1 0110:TPIU_CLK 0111: BT_JTAG_CLK/SWD_CK 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO8_SLEW_RATE                12
#define PON_BIT_PON_GPIO8_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO8_DRIVING                  10
#define PON_MASK_PON_GPIO8_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO8_SMT_EN                   9
#define PON_BIT_PON_GPIO8_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO8 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO8_PULL_CTRL                6
#define PON_MASK_PON_GPIO8_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO8_PINMUX_SEL               0
#define PON_MASK_PON_GPIO8_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: PWM2 0011: 0100:SDIO_D3 0101:SPI_1_CS0 0110:TPIU_DATA_3 0111: 1000: SPI_3_CS 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_10_11_CTRL
 * @brief                                            (@ 0X064)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO11_SLEW_RATE               28
#define PON_BIT_PON_GPIO11_SLEW_RATE                 ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO11_DRIVING                 26
#define PON_MASK_PON_GPIO11_DRIVING                  ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO11_SMT_EN                  25
#define PON_BIT_PON_GPIO11_SMT_EN                    ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO11 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO11_PULL_CTRL               22
#define PON_MASK_PON_GPIO11_PULL_CTRL                ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO11_PINMUX_SEL              16
#define PON_MASK_PON_GPIO11_PINMUX_SEL               ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: 0010: PWM5 0011: JTAG_TRST 0100: 0101:I2S0_MCK 0110: 0111: BT_JTAG_TRST 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO10_SLEW_RATE               12
#define PON_BIT_PON_GPIO10_SLEW_RATE                 ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO10_DRIVING                 10
#define PON_MASK_PON_GPIO10_DRIVING                  ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO10_SMT_EN                  9
#define PON_BIT_PON_GPIO10_SMT_EN                    ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO10 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO10_PULL_CTRL               6
#define PON_MASK_PON_GPIO10_PULL_CTRL                ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO10_PINMUX_SEL              0
#define PON_MASK_PON_GPIO10_PINMUX_SEL               ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: PWM4 0011: JTAG_TMS/SWD_IO 0100: 0101:SPI_1_CS2 0110: TPIU_CTRL 0111: BT_JTAG_TMS/SWD_IO 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_12_13_CTRL
 * @brief                                            (@ 0X068)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO13_SLEW_RATE               28
#define PON_BIT_PON_GPIO13_SLEW_RATE                 ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO13_DRIVING                 26
#define PON_MASK_PON_GPIO13_DRIVING                  ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO13_SMT_EN                  25
#define PON_BIT_PON_GPIO13_SMT_EN                    ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO13 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO13_PULL_CTRL               22
#define PON_MASK_PON_GPIO13_PULL_CTRL                ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO13_PINMUX_SEL              16
#define PON_MASK_PON_GPIO13_PINMUX_SEL               ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: 0010: PWM7 0011: 0100: 0101: I2S0_CLK 0110:UART1_OUT 0111: 1000:VOE_JTAG_TMS/SWD_IO 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO12_SLEW_RATE               12
#define PON_BIT_PON_GPIO12_SLEW_RATE                 ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO12_DRIVING                 10
#define PON_MASK_PON_GPIO12_DRIVING                  ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO12_SMT_EN                  9
#define PON_BIT_PON_GPIO12_SMT_EN                    ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO12 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO12_PULL_CTRL               6
#define PON_MASK_PON_GPIO12_PULL_CTRL                ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO12_PINMUX_SEL              0
#define PON_MASK_PON_GPIO12_PINMUX_SEL               ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: PWM6 0011: 0100: 0101:I2S0_SD_RX 0110:UART1_IN 0111: 1000:VOE_JTAG_CLK/SWD_CK 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_14_15_CTRL
 * @brief                                            (@ 0X06C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO15_SLEW_RATE               28
#define PON_BIT_PON_GPIO15_SLEW_RATE                 ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO15_DRIVING                 26
#define PON_MASK_PON_GPIO15_DRIVING                  ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO15_SMT_EN                  25
#define PON_BIT_PON_GPIO15_SMT_EN                    ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO15 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO15_PULL_CTRL               22
#define PON_MASK_PON_GPIO15_PULL_CTRL                ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO15_PINMUX_SEL              16
#define PON_MASK_PON_GPIO15_PINMUX_SEL               ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: SGPIO_TX 0010: PWM9 0011: 0100: 0101:I2S0_WS 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO14_SLEW_RATE               12
#define PON_BIT_PON_GPIO14_SLEW_RATE                 ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO14_DRIVING                 10
#define PON_MASK_PON_GPIO14_DRIVING                  ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO14_SMT_EN                  9
#define PON_BIT_PON_GPIO14_SMT_EN                    ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO14 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO14_PULL_CTRL               6
#define PON_MASK_PON_GPIO14_PULL_CTRL                ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO14_PINMUX_SEL              0
#define PON_MASK_PON_GPIO14_PINMUX_SEL               ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: SGPIO 0010: PWM8 0011: 0100: 0101:I2S0_SD_TX0 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_PON_GPIOF_16_17_CTRL
 * @brief                                            (@ 0X070)
 * @{
 *****************************************************************************/
#define PON_SHIFT_PON_GPIO17_SLEW_RATE               28
#define PON_BIT_PON_GPIO17_SLEW_RATE                 ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO17_DRIVING                 26
#define PON_MASK_PON_GPIO17_DRIVING                  ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO17_SMT_EN                  25
#define PON_BIT_PON_GPIO17_SMT_EN                    ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable PON GPIO17 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO17_PULL_CTRL               22
#define PON_MASK_PON_GPIO17_PULL_CTRL                ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO17_PINMUX_SEL              16
#define PON_MASK_PON_GPIO17_PINMUX_SEL               ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: 0010: PWM11 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define PON_SHIFT_PON_GPIO16_SLEW_RATE               12
#define PON_BIT_PON_GPIO16_SLEW_RATE                 ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define PON_SHIFT_PON_GPIO16_DRIVING                 10
#define PON_MASK_PON_GPIO16_DRIVING                  ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define PON_SHIFT_PON_GPIO16_SMT_EN                  9
#define PON_BIT_PON_GPIO16_SMT_EN                    ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable PON GPIO16 Schmitt trigger; 1: enable */
#define PON_SHIFT_PON_GPIO16_PULL_CTRL               6
#define PON_MASK_PON_GPIO16_PULL_CTRL                ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define PON_SHIFT_PON_GPIO16_PINMUX_SEL              0
#define PON_MASK_PON_GPIO16_PINMUX_SEL               ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: PWM10 0011: 0100: 0101:SPI_1_CS3 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_RMA_CTRL0
 * @brief                                            (@ 0X074)
 * @{
 *****************************************************************************/
#define PON_SHIFT_RMA_STATE                          8
#define PON_MASK_RMA_STATE                           ((u32)0x000000FF << 8)                              /*!<R 0x0  0x00 (normal state, default value) 0xA0(RMA0) 0xA1(RMA1) 0xA2(RMA2) */
#define PON_SHIFT_PWD_EN                             0
#define PON_MASK_PWD_EN                              ((u32)0x000000FF << 0)                              /*!<R/W Once 0x0  password write enable 0x65(ASCII: e) is to enable write magic number 0x00 is default value */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_RMA_CTRL1
 * @brief                                            (@ 0X078)
 * @{
 *****************************************************************************/
#define PON_SHIFT_SSZ_RMA_LOCK                       1
#define PON_BIT_SSZ_RMA_LOCK                         ((u32)0x00000001 << 1)                              /*!<R/W Once 0x0  SSZ RMA lock (1 to enable lock) */
#define PON_SHIFT_SZ_RMA_LOCK                        0
#define PON_BIT_SZ_RMA_LOCK                          ((u32)0x00000001 << 0)                              /*!<R/W Once 0x0  SZ RMA lock (1 to enable lock) */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_BT_CNTRL
 * @brief                                            (@ 0X084)
 * @{
 *****************************************************************************/
#define PON_SHIFT_TMCK_BT_ROM                        11
#define PON_BIT_TMCK_BT_ROM                          ((u32)0x00000001 << 11)                             /*!<R/W 0x0  internal timing bypass BT_ROM */
#define PON_SHIFT_DVSE_BT_ROM                        10
#define PON_BIT_DVSE_BT_ROM                          ((u32)0x00000001 << 10)                             /*!<R/W 0x0  delay option enable BT_ROM */
#define PON_SHIFT_DVS_BT_ROM                         6
#define PON_MASK_DVS_BT_ROM                          ((u32)0x0000000F << 6)                              /*!<R/W 0x0  delay option BT_ROM */
#define PON_SHIFT_TMCK_BT_RAM                        5
#define PON_BIT_TMCK_BT_RAM                          ((u32)0x00000001 << 5)                              /*!<R/W 0x0  internal timing bypass BT_RAM */
#define PON_SHIFT_DVSE_BT_RAM                        4
#define PON_BIT_DVSE_BT_RAM                          ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable BT_RAM */
#define PON_SHIFT_DVS_BT_RAM                         0
#define PON_MASK_DVS_BT_RAM                          ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option BT_RAM */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_GMAC_CNTRL
 * @brief                                            (@ 0X088)
 * @{
 *****************************************************************************/
#define PON_SHIFT_NAP_GMAC_SRAM1                     13
#define PON_BIT_NAP_GMAC_SRAM1                       ((u32)0x00000001 << 13)                             /*!<R/W 0x0  nap: light sleep gmac_sram1 */
#define PON_SHIFT_TMCK_GMAC_SRAM1                    12
#define PON_BIT_TMCK_GMAC_SRAM1                      ((u32)0x00000001 << 12)                             /*!<R/W 0x0  internal timing bypass gmac_sram1 */
#define PON_SHIFT_DVSE_GMAC_SRAM1                    11
#define PON_BIT_DVSE_GMAC_SRAM1                      ((u32)0x00000001 << 11)                             /*!<R/W 0x0  delay option enable gmac_sram1 */
#define PON_SHIFT_DVS_GMAC_SRAM1                     7
#define PON_MASK_DVS_GMAC_SRAM1                      ((u32)0x0000000F << 7)                              /*!<R/W 0x0  delay option gmac_sram1 */
#define PON_SHIFT_NAP_GMAC_SRAM0                     6
#define PON_BIT_NAP_GMAC_SRAM0                       ((u32)0x00000001 << 6)                              /*!<R/W 0x0  nap: light sleep gmac_sram0 */
#define PON_SHIFT_TMCK_GMAC_SRAM0                    5
#define PON_BIT_TMCK_GMAC_SRAM0                      ((u32)0x00000001 << 5)                              /*!<R/W 0x0  internal timing bypass gmac_sram0 */
#define PON_SHIFT_DVSE_GMAC_SRAM0                    4
#define PON_BIT_DVSE_GMAC_SRAM0                      ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable gmac_sram0 */
#define PON_SHIFT_DVS_GMAC_SRAM0                     0
#define PON_MASK_DVS_GMAC_SRAM0                      ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option gmac_sram0 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_ISP_CNTRL_0
 * @brief                                            (@ 0X08C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_ISPF                          29
#define PON_BIT_DVSE_ISPF                            ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable ispf */
#define PON_SHIFT_DVS_ISPF                           25
#define PON_MASK_DVS_ISPF                            ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option ispf */
#define PON_SHIFT_DVSE_ISPE                          24
#define PON_BIT_DVSE_ISPE                            ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable ispe */
#define PON_SHIFT_DVS_ISPE                           20
#define PON_MASK_DVS_ISPE                            ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option ispe */
#define PON_SHIFT_DVSE_ISPD                          19
#define PON_BIT_DVSE_ISPD                            ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable ispd */
#define PON_SHIFT_DVS_ISPD                           15
#define PON_MASK_DVS_ISPD                            ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option ispd */
#define PON_SHIFT_DVSE_ISPC                          14
#define PON_BIT_DVSE_ISPC                            ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable ispc */
#define PON_SHIFT_DVS_ISPC                           10
#define PON_MASK_DVS_ISPC                            ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option ispc */
#define PON_SHIFT_DVSE_ISPB                          9
#define PON_BIT_DVSE_ISPB                            ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable ispb */
#define PON_SHIFT_DVS_ISPB                           5
#define PON_MASK_DVS_ISPB                            ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option ispb */
#define PON_SHIFT_DVSE_ISPA                          4
#define PON_BIT_DVSE_ISPA                            ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable ispa */
#define PON_SHIFT_DVS_ISPA                           0
#define PON_MASK_DVS_ISPA                            ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option ispa */
/** @} */

