Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_pon_type.h
/**************************************************************************//**
 * @defgroup PON_REG_MEM_ISP_CNTRL_1
 * @brief                                            (@ 0X090)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_OSDBRIDGE                     29
#define PON_BIT_DVSE_OSDBRIDGE                       ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable osdbridge */
#define PON_SHIFT_DVS_OSDBRIDGE                      25
#define PON_MASK_DVS_OSDBRIDGE                       ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option osdbridge */
#define PON_SHIFT_DVSE_OSDPAINTER                    24
#define PON_BIT_DVSE_OSDPAINTER                      ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable osdpainter */
#define PON_SHIFT_DVS_OSDPAINTER                     20
#define PON_MASK_DVS_OSDPAINTER                      ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option osdpainter */
#define PON_SHIFT_DVSE_VIDEO_AMBA                    19
#define PON_BIT_DVSE_VIDEO_AMBA                      ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable video_amba */
#define PON_SHIFT_DVS_VIDEO_AMBA                     15
#define PON_MASK_DVS_VIDEO_AMBA                      ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option video_amba */
#define PON_SHIFT_DVSE_ISP_DMA3                      14
#define PON_BIT_DVSE_ISP_DMA3                        ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable isp_dma3 */
#define PON_SHIFT_DVS_ISP_DMA3                       10
#define PON_MASK_DVS_ISP_DMA3                        ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option isp_dma3 */
#define PON_SHIFT_DVSE_ISPH                          9
#define PON_BIT_DVSE_ISPH                            ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable isph */
#define PON_SHIFT_DVS_ISPH                           5
#define PON_MASK_DVS_ISPH                            ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option isph */
#define PON_SHIFT_DVSE_ISPG                          4
#define PON_BIT_DVSE_ISPG                            ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable ispg */
#define PON_SHIFT_DVS_ISPG                           0
#define PON_MASK_DVS_ISPG                            ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option ispg */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_ISP_CNTRL_2
 * @brief                                            (@ 0X094)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_MIPI                          4
#define PON_BIT_DVSE_MIPI                            ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mipi */
#define PON_SHIFT_DVS_MIPI                           0
#define PON_MASK_DVS_MIPI                            ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option mipi */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_COMM_CNTRL
 * @brief                                            (@ 0X098)
 * @{
 *****************************************************************************/
#define PON_SHIFT_NAP_USBOTG                         27
#define PON_BIT_NAP_USBOTG                           ((u32)0x00000001 << 27)                             /*!<R/W 0x0  nap: light sleep usbotg */
#define PON_SHIFT_TMCK_USBOTG                        26
#define PON_BIT_TMCK_USBOTG                          ((u32)0x00000001 << 26)                             /*!<R/W 0x0  internal timing bypass usbotg */
#define PON_SHIFT_DVSE_USBOTG                        25
#define PON_BIT_DVSE_USBOTG                          ((u32)0x00000001 << 25)                             /*!<R/W 0x0  delay option enable usbotg */
#define PON_SHIFT_DVS_USBOTG                         21
#define PON_MASK_DVS_USBOTG                          ((u32)0x0000000F << 21)                             /*!<R/W 0x0  delay option usbotg */
#define PON_SHIFT_NAP_SDMMC_PPBECC                   20
#define PON_BIT_NAP_SDMMC_PPBECC                     ((u32)0x00000001 << 20)                             /*!<R/W 0x0  nap: light sleep sdmmc_ppbecc */
#define PON_SHIFT_TMCK_SDMMC_PPBECC                  19
#define PON_BIT_TMCK_SDMMC_PPBECC                    ((u32)0x00000001 << 19)                             /*!<R/W 0x0  internal timing bypass sdmmc_ppbecc */
#define PON_SHIFT_DVSE_SDMMC_PPBECC                  18
#define PON_BIT_DVSE_SDMMC_PPBECC                    ((u32)0x00000001 << 18)                             /*!<R/W 0x0  delay option enable sdmmc_ppbecc */
#define PON_SHIFT_DVS_SDMMC_PPBECC                   14
#define PON_MASK_DVS_SDMMC_PPBECC                    ((u32)0x0000000F << 14)                             /*!<R/W 0x0  delay option sdmmc_ppbecc */
#define PON_SHIFT_NAP_SDMMC_DMASB0                   13
#define PON_BIT_NAP_SDMMC_DMASB0                     ((u32)0x00000001 << 13)                             /*!<R/W 0x0  nap: light sleep sdmmc_dmasb1 */
#define PON_SHIFT_TMCK_SDMMC_DMASB1                  12
#define PON_BIT_TMCK_SDMMC_DMASB1                    ((u32)0x00000001 << 12)                             /*!<R/W 0x0  internal timing bypass sdmmc_ppbecc */
#define PON_SHIFT_DVSE_SDMMC_DMASB1                  11
#define PON_BIT_DVSE_SDMMC_DMASB1                    ((u32)0x00000001 << 11)                             /*!<R/W 0x0  delay option enable sdmmc_dmasb1 */
#define PON_SHIFT_DVS_SDMMC_DMASB1                   7
#define PON_MASK_DVS_SDMMC_DMASB1                    ((u32)0x0000000F << 7)                              /*!<R/W 0x0  delay option sdmmc_dmasb1 */
#define PON_SHIFT_NAP_SDIO                           6
#define PON_BIT_NAP_SDIO                             ((u32)0x00000001 << 6)                              /*!<R/W 0x0  nap: light sleep sdio */
#define PON_SHIFT_TMCK_SDIO                          5
#define PON_BIT_TMCK_SDIO                            ((u32)0x00000001 << 5)                              /*!<R/W 0x0  internal timing bypass sdio */
#define PON_SHIFT_DVSE_SDIO                          4
#define PON_BIT_DVSE_SDIO                            ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable sdio */
#define PON_SHIFT_DVS_SDIO                           0
#define PON_MASK_DVS_SDIO                            ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option sdio */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_CPU_CNTRL
 * @brief                                            (@ 0X09C)
 * @{
 *****************************************************************************/
#define PON_SHIFT_TMCK_CPU_MEM                       5
#define PON_BIT_TMCK_CPU_MEM                         ((u32)0x00000001 << 5)                              /*!<R/W 0x0  internal timing bypass cpu_dtcm_ram */
#define PON_SHIFT_DVSE_CPU_MEM                       4
#define PON_BIT_DVSE_CPU_MEM                         ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable cpu_dtcm_ram */
#define PON_SHIFT_DVS_CPU_MEM                        0
#define PON_MASK_DVS_CPU_MEM                         ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option cpu_dtcm_ram */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_NN_CNTRL_0
 * @brief                                            (@ 0X0A0)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_NN_CLKCORE_G5                 29
#define PON_BIT_DVSE_NN_CLKCORE_G5                   ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable nn_clkCore_g5 */
#define PON_SHIFT_DVS_NN_CLKCORE_G5                  25
#define PON_MASK_DVS_NN_CLKCORE_G5                   ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option nn_clkCore_g5 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G4                 24
#define PON_BIT_DVSE_NN_CLKCORE_G4                   ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable nn_clkCore_g4 */
#define PON_SHIFT_DVS_NN_CLKCORE_G4                  20
#define PON_MASK_DVS_NN_CLKCORE_G4                   ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option nn_clkCore_g4 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G3                 19
#define PON_BIT_DVSE_NN_CLKCORE_G3                   ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable nn_clkCore_g3 */
#define PON_SHIFT_DVS_NN_CLKCORE_G3                  15
#define PON_MASK_DVS_NN_CLKCORE_G3                   ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option nn_clkCore_g3 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G2                 14
#define PON_BIT_DVSE_NN_CLKCORE_G2                   ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable nn_clkCore_g2 */
#define PON_SHIFT_DVS_NN_CLKCORE_G2                  10
#define PON_MASK_DVS_NN_CLKCORE_G2                   ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option nn_clkCore_g2 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G1                 9
#define PON_BIT_DVSE_NN_CLKCORE_G1                   ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable nn_clkCore_g1 */
#define PON_SHIFT_DVS_NN_CLKCORE_G1                  5
#define PON_MASK_DVS_NN_CLKCORE_G1                   ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option nn_clkCore_g1 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G0                 4
#define PON_BIT_DVSE_NN_CLKCORE_G0                   ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable nn_clkCore_g0 */
#define PON_SHIFT_DVS_NN_CLKCORE_G0                  0
#define PON_MASK_DVS_NN_CLKCORE_G0                   ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option nn_clkCore_g0 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_NN_CNTRL_1
 * @brief                                            (@ 0X0A4)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_NN_CLKCORE_G11                29
#define PON_BIT_DVSE_NN_CLKCORE_G11                  ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable nn_clkCore_g11 */
#define PON_SHIFT_DVS_NN_CLKCORE_G11                 25
#define PON_MASK_DVS_NN_CLKCORE_G11                  ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option nn_clkCore_g11 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G10                24
#define PON_BIT_DVSE_NN_CLKCORE_G10                  ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable nn_clkCore_g10 */
#define PON_SHIFT_DVS_NN_CLKCORE_G10                 20
#define PON_MASK_DVS_NN_CLKCORE_G10                  ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option nn_clkCore_g10 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G9                 19
#define PON_BIT_DVSE_NN_CLKCORE_G9                   ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable nn_clkCore_g9 */
#define PON_SHIFT_DVS_NN_CLKCORE_G9                  15
#define PON_MASK_DVS_NN_CLKCORE_G9                   ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option nn_clkCore_g9 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G8                 14
#define PON_BIT_DVSE_NN_CLKCORE_G8                   ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable nn_clkCore_g8 */
#define PON_SHIFT_DVS_NN_CLKCORE_G8                  10
#define PON_MASK_DVS_NN_CLKCORE_G8                   ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option nn_clkCore_g8 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G7                 9
#define PON_BIT_DVSE_NN_CLKCORE_G7                   ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable nn_clkCore_g7 */
#define PON_SHIFT_DVS_NN_CLKCORE_G7                  5
#define PON_MASK_DVS_NN_CLKCORE_G7                   ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option nn_clkCore_g7 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G6                 4
#define PON_BIT_DVSE_NN_CLKCORE_G6                   ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable nn_clkCore_g6 */
#define PON_SHIFT_DVS_NN_CLKCORE_G6                  0
#define PON_MASK_DVS_NN_CLKCORE_G6                   ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option nn_clkCore_g6 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_NN_CNTRL_2
 * @brief                                            (@ 0X0A8)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_NN_CLKCORE_G17                29
#define PON_BIT_DVSE_NN_CLKCORE_G17                  ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable nn_clkCore_g17 */
#define PON_SHIFT_DVS_NN_CLKCORE_G17                 25
#define PON_MASK_DVS_NN_CLKCORE_G17                  ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option nn_clkCore_g17 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G16                24
#define PON_BIT_DVSE_NN_CLKCORE_G16                  ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable nn_clkCore_g16 */
#define PON_SHIFT_DVS_NN_CLKCORE_G16                 20
#define PON_MASK_DVS_NN_CLKCORE_G16                  ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option nn_clkCore_g16 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G15                19
#define PON_BIT_DVSE_NN_CLKCORE_G15                  ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable nn_clkCore_g15 */
#define PON_SHIFT_DVS_NN_CLKCORE_G15                 15
#define PON_MASK_DVS_NN_CLKCORE_G15                  ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option nn_clkCore_g15 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G14                14
#define PON_BIT_DVSE_NN_CLKCORE_G14                  ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable nn_clkCore_g14 */
#define PON_SHIFT_DVS_NN_CLKCORE_G14                 10
#define PON_MASK_DVS_NN_CLKCORE_G14                  ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option nn_clkCore_g14 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G13                9
#define PON_BIT_DVSE_NN_CLKCORE_G13                  ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable nn_clkCore_g13 */
#define PON_SHIFT_DVS_NN_CLKCORE_G13                 5
#define PON_MASK_DVS_NN_CLKCORE_G13                  ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option nn_clkCore_g13 */
#define PON_SHIFT_DVSE_NN_CLKCORE_G12                4
#define PON_BIT_DVSE_NN_CLKCORE_G12                  ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable nn_clkCore_g12 */
#define PON_SHIFT_DVS_NN_CLKCORE_G12                 0
#define PON_MASK_DVS_NN_CLKCORE_G12                  ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option nn_clkCore_g12 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_NN_CNTRL_3
 * @brief                                            (@ 0X0AC)
 * @{
 *****************************************************************************/
#define PON_SHIFT_SLP_NN                             13
#define PON_BIT_SLP_NN                               ((u32)0x00000001 << 13)                             /*!<R/W 0x0  sleep: NN */
#define PON_SHIFT_RET_NN                             12
#define PON_BIT_RET_NN                               ((u32)0x00000001 << 12)                             /*!<R/W 0x0  ret: retention NN */
#define PON_SHIFT_NAP_NN                             11
#define PON_BIT_NAP_NN                               ((u32)0x00000001 << 11)                             /*!<R/W 0x0  nap: light sleep NN */
#define PON_SHIFT_TMCK_NN                            10
#define PON_BIT_TMCK_NN                              ((u32)0x00000001 << 10)                             /*!<R/W 0x0  internal timing bypass NN */
#define PON_SHIFT_DVSE_NN_CLKSH_DIV2                 9
#define PON_BIT_DVSE_NN_CLKSH_DIV2                   ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable nn_clkSh_div2 */
#define PON_SHIFT_DVS_NN_CLKSH_DIV2                  5
#define PON_MASK_DVS_NN_CLKSH_DIV2                   ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option nn_clkSh_div2 */
#define PON_SHIFT_DVSE_NN_ACLK                       4
#define PON_BIT_DVSE_NN_ACLK                         ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable nn_ACLK */
#define PON_SHIFT_DVS_NN_ACLK                        0
#define PON_MASK_DVS_NN_ACLK                         ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option nn_ACLK */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_VOE_CNTRL_0
 * @brief                                            (@ 0X0B0)
 * @{
 *****************************************************************************/
#define PON_SHIFT_TMCK_VOE                           31
#define PON_BIT_TMCK_VOE                             ((u32)0x00000001 << 31)                             /*!<R/W 0x0  tmck: internal timing bypass VOE */
#define PON_SHIFT_NAP_VOE                            30
#define PON_BIT_NAP_VOE                              ((u32)0x00000001 << 30)                             /*!<R/W 0x0  nap :light sleep VOE */
#define PON_SHIFT_DVSE_VOEMCU_ITCM_ROM               29
#define PON_BIT_DVSE_VOEMCU_ITCM_ROM                 ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable mbist_voemcu_itcm_rom */
#define PON_SHIFT_DVS_VOEMCU_ITCM_ROM                25
#define PON_MASK_DVS_VOEMCU_ITCM_ROM                 ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay_option voemcu_itcm_rom */
#define PON_SHIFT_DVSE_VOEMCU_ITCM_RAM               24
#define PON_BIT_DVSE_VOEMCU_ITCM_RAM                 ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable mbist_voemcu_itcm_ram */
#define PON_SHIFT_DVS_VOEMCU_ITCM_RAM                20
#define PON_MASK_DVS_VOEMCU_ITCM_RAM                 ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay_option voemcu_itcm_ram */
#define PON_SHIFT_DVSE_VOEMCU_DTCM_ROM               19
#define PON_BIT_DVSE_VOEMCU_DTCM_ROM                 ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable mbist_voemcu_dtcm_rom */
#define PON_SHIFT_DVS_VOEMCU_DTCM_ROM                15
#define PON_MASK_DVS_VOEMCU_DTCM_ROM                 ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay_option voemcu_dtcm_rom */
#define PON_SHIFT_DVSE_VOEMCU_DTCM                   14
#define PON_BIT_DVSE_VOEMCU_DTCM                     ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable mbist_voemcu_dtcm */
#define PON_SHIFT_DVS_VOEMCU_DTCM                    10
#define PON_MASK_DVS_VOEMCU_DTCM                     ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay_option voemcu_dtcm */
#define PON_SHIFT_DVSE_VOE_CPU_ICACHE                9
#define PON_BIT_DVSE_VOE_CPU_ICACHE                  ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable mbist_voe_cpu_icache */
#define PON_SHIFT_DVS_VOE_CPU_ICACHE                 5
#define PON_MASK_DVS_VOE_CPU_ICACHE                  ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay_option voe_cpu_icache */
#define PON_SHIFT_DVSE_VOE_CPU_DCACHE                4
#define PON_BIT_DVSE_VOE_CPU_DCACHE                  ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mbist_voe_cpu_dcache */
#define PON_SHIFT_DVS_VOE_CPU_DCACHE                 0
#define PON_MASK_DVS_VOE_CPU_DCACHE                  ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay_option voe_cpu_dcache */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_PLATFORM_CNTRL
 * @brief                                            (@ 0X0B4)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_DDRC                          14
#define PON_BIT_DVSE_DDRC                            ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable DDRC */
#define PON_SHIFT_DVS_DDRC                           10
#define PON_MASK_DVS_DDRC                            ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option DDRC */
#define PON_SHIFT_DVSE_PLATFORM_ROM                  9
#define PON_BIT_DVSE_PLATFORM_ROM                    ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable PLATFORM_ROM */
#define PON_SHIFT_DVS_PLATFORM_ROM                   5
#define PON_MASK_DVS_PLATFORM_ROM                    ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option PLATFORM_ROM */
#define PON_SHIFT_DVSE_PLATFORM_RAM                  4
#define PON_BIT_DVSE_PLATFORM_RAM                    ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable PLATFORM_RAM */
#define PON_SHIFT_DVS_PLATFORM_RAM                   0
#define PON_MASK_DVS_PLATFORM_RAM                    ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option PLATFORM_RAM */
/** @} */

