Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_pon_type.h
/**************************************************************************//**
 * @defgroup PON_REG_MEM_ENC_CNTRL_0
 * @brief                                            (@ 0X0B8)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_ENC_GROUP05_1                 29
#define PON_BIT_DVSE_ENC_GROUP05_1                   ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable mbist_enc_group05_1 */
#define PON_SHIFT_DVS_ENC_GROUP05_1                  25
#define PON_MASK_DVS_ENC_GROUP05_1                   ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option mbist_enc_group05_1 */
#define PON_SHIFT_DVSE_ENC_GROUP04                   24
#define PON_BIT_DVSE_ENC_GROUP04                     ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable mbist_enc_group04 */
#define PON_SHIFT_DVS_ENC_GROUP04                    20
#define PON_MASK_DVS_ENC_GROUP04                     ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option mbist_enc_group04 */
#define PON_SHIFT_DVSE_ENC_GROUP03_2                 19
#define PON_BIT_DVSE_ENC_GROUP03_2                   ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable mbist_enc_group03_2 */
#define PON_SHIFT_DVS_ENC_GROUP03_2                  15
#define PON_MASK_DVS_ENC_GROUP03_2                   ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option mbist_enc_group03_2 */
#define PON_SHIFT_DVSE_ENC_GROUP03_1                 14
#define PON_BIT_DVSE_ENC_GROUP03_1                   ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable mbist_enc_group03_1 */
#define PON_SHIFT_DVS_ENC_GROUP03_1                  10
#define PON_MASK_DVS_ENC_GROUP03_1                   ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option mbist_enc_group03_1 */
#define PON_SHIFT_DVSE_ENC_GROUP02                   9
#define PON_BIT_DVSE_ENC_GROUP02                     ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable mbist_enc_group02 */
#define PON_SHIFT_DVS_ENC_GROUP02                    5
#define PON_MASK_DVS_ENC_GROUP02                     ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option mbist_enc_group02 */
#define PON_SHIFT_DVSE_ENC_GROUP01                   4
#define PON_BIT_DVSE_ENC_GROUP01                     ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mbist_enc_group01 */
#define PON_SHIFT_DVS_ENC_GROUP01                    0
#define PON_MASK_DVS_ENC_GROUP01                     ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option mbist_enc_group01 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_ENC_CNTRL_1
 * @brief                                            (@ 0X0BC)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_ENC_GROUP10_1                 29
#define PON_BIT_DVSE_ENC_GROUP10_1                   ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable mbist_enc_group10_1 */
#define PON_SHIFT_DVS_ENC_GROUP10_1                  25
#define PON_MASK_DVS_ENC_GROUP10_1                   ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option mbist_enc_group10_1 */
#define PON_SHIFT_DVSE_ENC_GROUP09                   24
#define PON_BIT_DVSE_ENC_GROUP09                     ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable mbist_enc_group09 */
#define PON_SHIFT_DVS_ENC_GROUP09                    20
#define PON_MASK_DVS_ENC_GROUP09                     ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option mbist_enc_group09 */
#define PON_SHIFT_DVSE_ENC_GROUP08                   19
#define PON_BIT_DVSE_ENC_GROUP08                     ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable mbist_enc_group08 */
#define PON_SHIFT_DVS_ENC_GROUP08                    15
#define PON_MASK_DVS_ENC_GROUP08                     ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option mbist_enc_group08 */
#define PON_SHIFT_DVSE_ENC_GROUP07                   14
#define PON_BIT_DVSE_ENC_GROUP07                     ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable mbist_enc_group07 */
#define PON_SHIFT_DVS_ENC_GROUP07                    10
#define PON_MASK_DVS_ENC_GROUP07                     ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option mbist_enc_group07 */
#define PON_SHIFT_DVSE_ENC_GROUP06                   9
#define PON_BIT_DVSE_ENC_GROUP06                     ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable mbist_enc_group06 */
#define PON_SHIFT_DVS_ENC_GROUP06                    5
#define PON_MASK_DVS_ENC_GROUP06                     ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option mbist_enc_group06 */
#define PON_SHIFT_DVSE_ENC_GROUP05_2                 4
#define PON_BIT_DVSE_ENC_GROUP05_2                   ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mbist_enc_group05_2 */
#define PON_SHIFT_DVS_ENC_GROUP05_2                  0
#define PON_MASK_DVS_ENC_GROUP05_2                   ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option mbist_enc_group05_2 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_ENC_CNTRL_2
 * @brief                                            (@ 0X0C0)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_ENC_GROUP13_1                 29
#define PON_BIT_DVSE_ENC_GROUP13_1                   ((u32)0x00000001 << 29)                             /*!<R/W 0x0  delay option enable mbist_enc_group13_1 */
#define PON_SHIFT_DVS_ENC_GROUP13_1                  25
#define PON_MASK_DVS_ENC_GROUP13_1                   ((u32)0x0000000F << 25)                             /*!<R/W 0x0  delay option mbist_enc_group13_1 */
#define PON_SHIFT_DVSE_ENC_GROUP12_2                 24
#define PON_BIT_DVSE_ENC_GROUP12_2                   ((u32)0x00000001 << 24)                             /*!<R/W 0x0  delay option enable mbist_enc_group12_2 */
#define PON_SHIFT_DVS_ENC_GROUP12_2                  20
#define PON_MASK_DVS_ENC_GROUP12_2                   ((u32)0x0000000F << 20)                             /*!<R/W 0x0  delay option mbist_enc_group12_2 */
#define PON_SHIFT_DVSE_ENC_GROUP12_1                 19
#define PON_BIT_DVSE_ENC_GROUP12_1                   ((u32)0x00000001 << 19)                             /*!<R/W 0x0  delay option enable mbist_enc_group12_1 */
#define PON_SHIFT_DVS_ENC_GROUP12_1                  15
#define PON_MASK_DVS_ENC_GROUP12_1                   ((u32)0x0000000F << 15)                             /*!<R/W 0x0  delay option mbist_enc_group12_1 */
#define PON_SHIFT_DVSE_ENC_GROUP11_2                 14
#define PON_BIT_DVSE_ENC_GROUP11_2                   ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable mbist_enc_group11_2 */
#define PON_SHIFT_DVS_ENC_GROUP11_2                  10
#define PON_MASK_DVS_ENC_GROUP11_2                   ((u32)0x0000000F << 10)                             /*!<R/W 0x0  delay option mbist_enc_group11_2 */
#define PON_SHIFT_DVSE_ENC_GROUP11_1                 9
#define PON_BIT_DVSE_ENC_GROUP11_1                   ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable mbist_enc_group11_1 */
#define PON_SHIFT_DVS_ENC_GROUP11_1                  5
#define PON_MASK_DVS_ENC_GROUP11_1                   ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option mbist_enc_group11_1 */
#define PON_SHIFT_DVSE_ENC_GROUP10_2                 4
#define PON_BIT_DVSE_ENC_GROUP10_2                   ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mbist_enc_group10_2 */
#define PON_SHIFT_DVS_ENC_GROUP10_2                  0
#define PON_MASK_DVS_ENC_GROUP10_2                   ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option mbist_enc_group10_2 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_ENC_CNTRL_3
 * @brief                                            (@ 0X0C4)
 * @{
 *****************************************************************************/
#define PON_SHIFT_NAP_ENCODER                        11
#define PON_BIT_NAP_ENCODER                          ((u32)0x00000001 << 11)                             /*!<R/W 0x0  nap: light sleep ENCODER */
#define PON_SHIFT_TMCK_ENCODER                       10
#define PON_BIT_TMCK_ENCODER                         ((u32)0x00000001 << 10)                             /*!<R/W 0x0  internal timing bypass ENCODER */
#define PON_SHIFT_DVSE_ENC_GROUP14                   9
#define PON_BIT_DVSE_ENC_GROUP14                     ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable mbist_enc_group14 */
#define PON_SHIFT_DVS_ENC_GROUP14                    5
#define PON_MASK_DVS_ENC_GROUP14                     ((u32)0x0000000F << 5)                              /*!<R/W 0x0  delay option mbist_enc_group14 */
#define PON_SHIFT_DVSE_ENC_GROUP13_2                 4
#define PON_BIT_DVSE_ENC_GROUP13_2                   ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mbist_enc_group13_2 */
#define PON_SHIFT_DVS_ENC_GROUP13_2                  0
#define PON_MASK_DVS_ENC_GROUP13_2                   ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option mbist_enc_group13_2 */
/** @} */

/**************************************************************************//**
 * @defgroup PON_REG_MEM_RSA
 * @brief                                            (@ 0X0C8)
 * @{
 *****************************************************************************/
#define PON_SHIFT_DVSE_RSA                           4
#define PON_BIT_DVSE_RSA                             ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable mbist_RSA */
#define PON_SHIFT_DVS_RSA                            0
#define PON_MASK_DVS_RSA                             ((u32)0x0000000F << 0)                              /*!<R/W 0x0  delay option mbist_RSA */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_PON
 * @{
 * @brief rtl8735b_PON Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t PON_REG_PON_SYSON_CTRL ;                 /*!<   register,  Address offset: 0x000 */
	__IO uint32_t PON_REG_PON_SYSPLL_CTRL0 ;               /*!<   register,  Address offset: 0x004 */
	__IO uint32_t PON_REG_PON_SYSPLL_CTRL1 ;               /*!<   register,  Address offset: 0x008 */
	__IO uint32_t PON_REG_PON_SYSPLL_CTRL2 ;               /*!<   register,  Address offset: 0x00C */
	__IO uint32_t PON_REG_PON_SYSPLL_CTRL3 ;               /*!<   register,  Address offset: 0x010 */
	__IO uint32_t PON_REG_PON_PERIPLL_CTRL0 ;              /*!<   register,  Address offset: 0x014 */
	__IO uint32_t PON_REG_PON_PERIPLL_CTRL1 ;              /*!<   register,  Address offset: 0x018 */
	__IO uint32_t PON_REG_PON_PERIPLL_CTRL2 ;              /*!<   register,  Address offset: 0x01C */
	__IO uint32_t PON_REG_PON_PERIPLL_CTRL3 ;              /*!<   register,  Address offset: 0x020 */
	__IO uint32_t PON_REG_PON_FUNC_EN_CTRL ;               /*!<   register,  Address offset: 0x024 */
	__IO uint32_t PON_REG_PON_PLL_DBG ;                    /*!<   register,  Address offset: 0x028 */
	__IO uint32_t PON_REG_PON_FUNC_CLK_CTRL ;              /*!<   register,  Address offset: 0x02C */
	__IO uint32_t PON_REG_PON_BT_CTRL ;                    /*!<   register,  Address offset: 0x030 */
	__I  uint32_t PON_REG_UART_INTR_STS ;                  /*!<   register,  Address offset: 0x034 */
	__IO uint32_t PON_REG_WDT_RST_CTRL ;                   /*!<   register,  Address offset: 0x038 */
	__IO uint32_t PON_REG_PON_BUS_CTRL ;                   /*!<   register,  Address offset: 0x03C */
	__IO uint32_t PON_REG_PON_PLL_DIVIDER_CTRL ;           /*!<   register,  Address offset: 0x040 */
	__IO uint32_t PON_REG_SUPER_SEC_EF_CTRL ;              /*!<   register,  Address offset: 0x044 */
	__IO uint32_t PON_REG_BOOT_STATE ;                     /*!<   register,  Address offset: 0x048 */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	__IO uint32_t PON_RSVD ;                               /*!<   register,  Address offset: 0x04C */
#else
	__IO uint32_t PON_REG_BOOT_STATE1 ;                    /*!<   register,  Address offset: 0x04C */
#endif
	__IO uint32_t PON_REG_PON_GPIOF_0_1_CTRL ;             /*!<   register,  Address offset: 0x050 */
	__IO uint32_t PON_REG_PON_GPIOF_2_3_CTRL ;             /*!<   register,  Address offset: 0x054 */
	__IO uint32_t PON_REG_PON_GPIOF_4_5_CTRL ;             /*!<   register,  Address offset: 0x058 */
	__IO uint32_t PON_REG_PON_GPIOF_6_7_CTRL ;             /*!<   register,  Address offset: 0x05C */
	__IO uint32_t PON_REG_PON_GPIOF_8_9_CTRL ;             /*!<   register,  Address offset: 0x060 */
	__IO uint32_t PON_REG_PON_GPIOF_10_11_CTRL ;           /*!<   register,  Address offset: 0x064 */
	__IO uint32_t PON_REG_PON_GPIOF_12_13_CTRL ;           /*!<   register,  Address offset: 0x068 */
	__IO uint32_t PON_REG_PON_GPIOF_14_15_CTRL ;           /*!<   register,  Address offset: 0x06C */
	__IO uint32_t PON_REG_PON_GPIOF_16_17_CTRL ;           /*!<   register,  Address offset: 0x070 */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	__O  uint32_t PON_REG_MEM_WLAN_CNTRL_0 ;               /*!<   register,  Address offset: 0x074 */
	__O  uint32_t PON_REG_MEM_WLAN_CNTRL_1 ;               /*!<   register,  Address offset: 0x078 */
#else
	__IO uint32_t PON_REG_RMA_CTRL0 ;                      /*!<   register,  Address offset: 0x074 */
	__IO uint32_t PON_REG_RMA_CTRL1 ;                      /*!<   register,  Address offset: 0x078 */
#endif
	__O  uint32_t PON_REG_MEM_WLAN_CNTRL_2 ;               /*!<   register,  Address offset: 0x07C */
	__O  uint32_t PON_REG_MEM_WLAN_CNTRL_3 ;               /*!<   register,  Address offset: 0x080 */
	__IO uint32_t PON_REG_MEM_BT_CNTRL ;                   /*!<   register,  Address offset: 0x084 */
	__IO uint32_t PON_REG_MEM_GMAC_CNTRL ;                 /*!<   register,  Address offset: 0x088 */
	__IO uint32_t PON_REG_MEM_ISP_CNTRL_0 ;                /*!<   register,  Address offset: 0x08C */
	__IO uint32_t PON_REG_MEM_ISP_CNTRL_1 ;                /*!<   register,  Address offset: 0x090 */
	__IO uint32_t PON_REG_MEM_ISP_CNTRL_2 ;                /*!<   register,  Address offset: 0x094 */
	__IO uint32_t PON_REG_MEM_COMM_CNTRL ;                 /*!<   register,  Address offset: 0x098 */
	__IO uint32_t PON_REG_MEM_CPU_CNTRL ;                  /*!<   register,  Address offset: 0x09C */
	__IO uint32_t PON_REG_MEM_NN_CNTRL_0 ;                 /*!<   register,  Address offset: 0x0A0 */
	__IO uint32_t PON_REG_MEM_NN_CNTRL_1 ;                 /*!<   register,  Address offset: 0x0A4 */
	__IO uint32_t PON_REG_MEM_NN_CNTRL_2 ;                 /*!<   register,  Address offset: 0x0A8 */
	__IO uint32_t PON_REG_MEM_NN_CNTRL_3 ;                 /*!<   register,  Address offset: 0x0AC */
	__IO uint32_t PON_REG_MEM_VOE_CNTRL_0 ;                /*!<   register,  Address offset: 0x0B0 */
	__IO uint32_t PON_REG_MEM_PLATFORM_CNTRL ;             /*!<   register,  Address offset: 0x0B4 */
	__IO uint32_t PON_REG_MEM_ENC_CNTRL_0 ;                /*!<   register,  Address offset: 0x0B8 */
	__IO uint32_t PON_REG_MEM_ENC_CNTRL_1 ;                /*!<   register,  Address offset: 0x0BC */
	__IO uint32_t PON_REG_MEM_ENC_CNTRL_2 ;                /*!<   register,  Address offset: 0x0C0 */
	__IO uint32_t PON_REG_MEM_ENC_CNTRL_3 ;                /*!<   register,  Address offset: 0x0C4 */
	__IO uint32_t PON_REG_MEM_RSA ;                        /*!<   register,          Address offset: 0x0C8 */
} PON_TypeDef;
/** @} */

#endif
